Repository: 84000/data-translation-memory
Catalog: toh114-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཆོས་གཉིས་ཀྱིས་སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་བྱེད་དེ།
en: “Noble son,” said the Blessed One, “two factors cause beings to fall into the hell realms.

source: གཉིས་གང་ཞེ་ན། འདོད་ཆགས་དང་། ཞེ་སྡང་སྟེ། རིགས་ཀྱི་བུ་ཆོས་དེ་གཉིས་ཀྱིས་སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་བྱེད་དོ། །
en: These two are: (1) attachment and ( ) anger. Noble son, these two factors cause beings to fall into the hell realms.

source: རིགས་ཀྱི་བུ་ཆོས་འདི་བཞིས་ནི་བདེ་འགྲོར་འགྲོ་བར་བྱེད་དེ། །
en: Noble son, four factors cause beings to be reborn among the favorable states of existence.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་དང་། བསམ་པ་ཡོངས་སུ་དག་པ་དང་།
en: These four are: (1) regarding all beings equally, ( ) purity of motivation,

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པའོ། །
en: relinquishing all possessions, and (4) the practice of celibacy.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: The Blessed One then uttered these verses:

source: རྒྱལ་ཆེན་སྦྱིན་པ་འདི་ནི་རྫུ་འཕྲུལ་ཆེ། །ངན་སོང་ངན་འགྲོ་ཀུན་ལས་རབ་གྲོལ་བྱེད། །
en: “Great king! This generosity is a great miracle! It liberates from the miserable fates of the lower realms.

source: རྨོངས་པའི་སེམས་ཅན་རྟག་ཏུ་འདོད་ལ་ཆགས། །ཆགས་པ་སྣ་ཚོགས་བརྒྱ་ཡིས་དེ་དག་མྱོས། །
en: Deluded beings, continuously bound by sense pleasures, Are intoxicated by many hundred kinds of greed.

source: མདོ་སྡེ་འདི་ལ་དད་པར་མི་བྱེད་ཅིང་། །སངས་རྒྱས་བསྟན་ལ་སྦྱིན་པ་སྦྱིན་མི་བྱེད། །
en: “They do not have faith in this sūtra, Nor are they generous toward the Buddha’s teaching.

source: སེམས་ཅན་དེ་འདྲ་བ་དག་ངན་སོང་སར། །སྐྱེས་ནས་ཚོར་བ་དག་ཀྱང་མྱོང་བར་འགྱུར། །སེམས་ཅན་དེ་དག་ལ་ནི་ཕན་པའི་ཕྱིར། །
en: Such beings will be reborn in the lower realms And there experience suffering. “To benefit such beings,

source: དེ་ལྟར་མདོ་སྡེ་མཐུ་ཆེན་རབ་ཏུ་བསྟན། །མདོ་སྡེ་འདི་ལ་རྟག་ཏུ་དད་པ་གང་། །
en: I have taught this powerful sūtra. To a king with unwavering faith in it,

source: དེ་ལ་གཤེད་བྱེད་མེད་ཅིང་སྡིག་བྱེད་མེད། །འབྱུང་པོ་གྲུལ་བུམ་ལྟོ་འཕྱེ་ཆེན་པོ་མེད། །རྒྱལ་པོ་དེ་ལ་སྡིག་པ་བྱེད་པ་མེད། །
en: No kṛtyā or evildoer, “No bhūta, kumbhāṇḍa, or mahoraga Can cause any harm.

source: ལེགས་འདྲི་ཉན་དུ་འཇུག་དང་མཆོད་པ་དང་། །ལེགས་པར་འཛིན་པའི་བསོད་ནམས་གང་ཡིན་པ། །
en: The merit of writing down this sūtra correctly, Of hearing it, venerating it, and upholding it,

source: སངས་རྒྱས་ཡེ་ཤེས་ཀྱིས་ནི་བསྔགས་པ་དེ། །སེམས་ཅན་ཀུན་གྱིས་བསྐལ་མང་བརྗོད་མི་ནུས། །
en: “Is praised by the buddhas through their wisdom, And cannot be expressed by beings, Even if they tried for many eons.

source: གང་དག་རྟག་ཏུ་སངས་རྒྱས་བྱང་ཆུབ་རྣམས། །བརྗེད་ཅིང་མཆོད་པ་བྱེད་པ་དེ་དག་དང་། །
en: The merit generated by those who continuously honor “And worship the buddhas and the bodhisattvas

source: དེ་ཡི་བརྒྱ་སྟོང་ཆར་ཡང་མི་ཕོད་དོ། །
en: Does not match even a hundred-thousandth portion

source: ལ་ལ་གཞན་འགས་མདོ་སྡེ་འདི་ཉིད་ལས། །ཡི་གེ་འབྲུ་གཅིག་ཙམ་ཡང་ལེགས་བྲིས་ན། །དེ་ལ་བསོད་ནམས་སྔ་མ་དེ་ཡིས་ནི། །
en: Of the merit of those who write down Even just a single letter of this sūtra.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་དད་དེ།
en: “Blessed One, noble sons and daughters who have faith in this Dharma

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མངོན་པར་མཆོད་པ་དང་
en: worship it with flowers, incense, perfumes, flower garlands, ointments, parasols, victory banners, and flags,

source: ཆོས་སྨྲ་བ་དེ་དག་དང་། འདྲི་བ་རྣམས་དང་། འཛིན་པ་རྣམས་ལ་མཆོད་པ་ཆེན་པོས་མཆོད་པ་བགྱིད་པ་དེ་དག་ནི
en: and who worship with great offerings those who teach it, write it down, and memorize it,

source: ཚེ་འདི་ཉིད་ལ་ཡོན་ཏན་དང་ཕན་ཡོན་མང་པོ་ཐོབ་པར་འགྱུར་ཏེ།
en: will generate many excellent qualities and benefits in this very life.

source: དེའི་ལུས་ལ་མིག་ནད་དང་། རྣ་ནད་དང་། སྣ་ནད་དང་། ལྕེ་ནད་དང་། རིམས་ནད་དང་། དུག་དང་། མཚོན་དང་། མེས་མི་ཚུགས་ལགས་སོ། །
en: They will not be harmed by eye, ear, nose, or tongue diseases, nor by fevers, poisons, weapons, or fire.

source: དེ་དག་ལ་ཕ་མས་ཡིད་བདེ་བ་དང་། བུ་དང་ཆུང་མས་ཡིད་བདེ་བ་དང་། ཁྱིམ་གྱིས་ཡིད་བདེ་བ་འབྱུང་བར་འགྱུར་ལགས་སོ། །
en: They will live happily with their parents, children, spouses, and families,

source: གཡུལ་འགྱེད་པ་ཐམས་ཅད་དུ་ཡང་རྒྱལ་བར་འགྱུར་རོ། །
en: and will be victorious in every battle.

source: འགུམ་པའི་ཚེ་ཡང་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས་ཡང་དག་པར་དབུགས་འབྱིན་པར་མཛད་དེ། ཀྱེ་མི་ཁྱོད་ཚུར་ཤོག །འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སོང་ཤིག
en: When they die, the thus-gone one Akṣobhya will bring them relief, saying, ‘Come. Enter the realm of Sukhāvatī.

source: སྐྱེས་བུ་ཆེན་པོ་ཁྱོད་ནི་དགེ་བའི་རྩ་བ་འབར་བ་དང་ལྡན་ཏེ། གང་དུ་འདོད་པའི་གནས་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །ཞེས་གསུང་ངོ་། །
en: Great being, you glow with the roots of virtue! You will be reborn wherever you wish.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent, Blessed One!” continued the bodhisattva great being noble Avaloki­teśvara.

source: དེ་བཞིན་གཤེགས་པས་འདི་འཛམ་བུའི་གླིང་དུ་བཞག་པ་ནི་དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་བགྱིད་པ་ལགས་སོ། །
en: “It is excellent that this teaching has been established in this world by the Thus-Gone One and that it performs his awakened activity.

source: བཅོམ་ལྡན་འདས་རིག་སྔགས་ཆེན་པོ་འདི་ནི་ལས་ཐམས་ཅད་རྣམ་པར་དག་པར་བགྱིད་པ་ལགས་སོ། །
en: Blessed One, this great knowledge completely purifies all karma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་ནི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་དག་གི་ཡུལ་ན་སྤྱོད་པར་མི་འགྱུར་རོ། །
en: “Noble son,” replied the Blessed One, “this teaching will not spread among beings of inferior merit.

source: སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་དག་གིས་ཐོས་པར་མི་འགྱུར་ལག་ཏུ་འོང་བར་མི་འགྱུར་རོ། །
en: Those beings will not hear this teaching. It will not come into their hands.

source: སངས་རྒྱས་ཀྱི་མཐུས་གང་གི་ལག་ཏུ་འོངས་སམ།
en: When, through the power of the Buddha, this teaching comes into someone’s hands,

source: དེ་བཞིན་གཤེགས་པས་ཉན་དུ་བཅུག་ན། དེས་ཐོས་པའི་མོད་ཁོ་ན་ལ་བྲི་བར་བྱ།
en: or when the thus-gone ones cause someone to hear it, that person should immediately write it down,

source: ཡི་གེར་འདྲིར་གཞུག་པར་བྱ། བཀླག་པར་བྱའོ། །
en: commission it to be written, and read it aloud.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཙམ་ཐོས་ན་
en: Noble son, after merely hearing the name of this Dharma teaching that is equal to the Thus-Gone One,

source: ཡང་ངན་འགྲོས་འཇིགས་པར་མི་འགྱུར་རོ། །
en: one will not have to fear the lower realms.

source: ལ་ལ་ཞིག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཡིག་འབྲུ་གཅིག་ཙམ་མམ།
en: Someone who propagates just a single letter or a single word from this Dharma teaching,

source: མིང་ཙམ་ཉན་དུ་བཅུག་གམ། ཕྱོགས་སམ། ཡུལ་འགའ་ཞིག་ཏུ་ལུང་འབོགས་པར་བྱེད་ན། དེ་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: or transmits it in some land or country, should be regarded as equal to the Thus-Gone One,

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བ་ཁོ་ནར་མཆོད་པར་བྱའོ། །དེ་ནི་ཕ་མ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: should be worshiped as a thus-gone one, and should be regarded as one’s own parent.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་དེ་བཞིན་གཤེགས་པ་བདུན་པོ་རྣམས་ཀྱིས་གསུངས་སོ། །
en: Noble son, this Dharma teaching has been taught by the seven thus-gone ones,

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །ལྷ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་བཟུང་ངོ་། །ཡོངས་སུ་བསྐྱངས་སོ། །
en: has been rejoiced in by all the bodhisattvas, and has been upheld and protected by all the gods.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་མ་ལྟ་བུའོ། །
en: This Dharma teaching is like the father and mother of all bodhisattvas.”

source: བཅོམ་ལྡན་འདས་སླད་མའི་དུས་སླད་མའི་ཚེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཐམས་ཅད་རྫོགས་པར་གང་དུ་སྤྱོད་པར་འགྱུར་ལགས།
en: “Blessed One, in the future, where will this Dharma teaching continue to spread in its complete form?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་དང་།
en: “Noble son,” said the Blessed One, “this Dharma teaching will spread and remain in its complete form in the oceanic abode of the king of the nāgas,

source: སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་གནས་སུ་ཐམས་ཅད་རྫོགས་པར་གནས་པར་འགྱུར་རོ། །
en: and in the abode of the gods of the Heaven of the Thirty-Three.

source: ལྷོ་ཕྱོགས་སུ་ཡང་སྤྱོད་པར་འགྱུར་རོ། །
en: It will spread to the southern region.

source: འཛམ་བུའི་གླིང་དུ་ནི་ཅུང་ཟད་ཙམ་གནས་པར་འགྱུར་ཏེ། གནས་ཁ་ཅིག་ཏུ་ནི་སྤྱོད་ཁ་ཅིག་ཏུ་ནི་མི་སྤྱོད་པར་འགྱུར་རོ། །
en: In this world it will remain only for a while. Here, it will spread to some places but not to others.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིསབྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Vajrapāṇi,” continued the Blessed One,

source: ལག་ན་རྡོ་རྗེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བྱ་བ་དང་། བཀླག་པར་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་དང་། ཉན་དུ་གཞུག་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་གཏད་དོ། །
en: “I entrust this Dharma teaching to you. Memorize it, read it aloud, venerate it, and disseminate it.

source: དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནུབ་པར་གྱུར་ཏ་རེ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་བྱ་བ་བྱེད་པ་ཡིན་ནོ།
en: Do not let this Dharma teaching that is equal to the Thus-Gone One vanish, for it performs the activity of a thus-gone one.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བགྱི་བ་དང་།
en: “Blessed One, I will take up this Dharma teaching,” replied the bodhisattva Vajrapāṇi.

source: བཀླག་པར་བགྱི་བ་དང་། མཆོད་པར་བགྱི་བ་དང་། ཉན་དུ་གཞུག་པར་བགྱི་བའི་སླད་དུ་བདག་གིས་གཟུང་ལགས་སོ། །
en: “I will memorize it, read it aloud, venerate it, and disseminate it.

source: ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་མཆོད་པར་བགྱི། རྗེད་པར་བགྱིའོ། །
en: I will venerate and honor those who teach it.

source: གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། ཆོས་སྨྲ་བ་དེ་དག་ལ་མཆོད་པར་བགྱིད་པ་དེ་ནི་བདག་ལ་ཡང་མཆོད་པར་བགྱིད་པ་ལགས་ཏེ། དེ་ནི་བདག་གིས་བསྲུང་བར་བགྱི། ཡོངས་སུ་བསྐྱང་བར་བགྱི་སྟེ།
en: Those who worship its teachers also worship me, so I will protect them and look after them.

source: བདག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བཀའ་དྲིན་གཟོ་བར་བགྱིད་དོ། །
en: I will remember the kindness of the Thus-Gone One.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ལག་ན་རྡོ་རྗེ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One expressed his approval to the bodhisattva Vajrapāṇi, saying, “Excellent, excellent, Vajrapāṇi!

source: ཁྱོད་ཀྱིས་དེ་ལྟར་གྱིས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Act in that way!” The bodhisattva noble Avaloki­teśvara then said to the Blessed One,

source: ཆོས་ཉན་པ་དེ་དག་དང་། ཡི་གེར་འདྲི་བ་རྣམས་དང་། འཛིན་པ་རྣམས་དང་། ཀློག་པ་རྣམས་དང་། ཉན་དུ་འཇུག་པ་རྣམས་ལ་ཡང་མངོན་པར་མཆོད་པར་བགྱིའོ། །
en: I too will worship those who listen to it, write it down, read it aloud, memorize it, and disseminate it.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་དག་གི་ཡུལ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱུང་ངམ་གལ་ཏེ་
en: Blessed One, if this Dharma teaching should spread among beings of inferior merit

source: རྒྱལ་པོ་ཆོས་དང་མི་ལྡན་པའི་ཡུལ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱུང་སྟེ་སྤྱོད་པ་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་རྒྱལ་པོ་དེ་མཆོད་པར་མི་བགྱིད།
en: or where an immoral king rules, that king will not worship this Dharma teaching.

source: དད་པར་མི་བགྱིད་ལ།
en: He will not have faith in it.

source: ཆོས་སྨྲ་བ་དེ་དག་དང་། ཡི་གེར་འདྲི་བ་རྣམས་དང་། འཛིན་པ་རྣམས་དང་། ཀློག་པ་རྣམས་དང་། ཉན་དུ་འཇུག་པ་རྣམས་དང་། ལུང་འབོགས་པ་རྣམས་ལ་ཡང་མཆོད་པར་མི་བགྱིད།
en: He also will not worship those who teach it, write it down, read it aloud, memorize it, disseminate it, or transmit it.

source: བླ་མའི་འདུ་ཤེས་སྐྱེད་པར་མི་བགྱིད་ན། དེས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནུབ་པར་འགྱུར་ལགས་སོ། །
en: He will not perceive them as his master. For these reasons, this Dharma teaching will vanish.

source: དེའི་ཡུལ་དུ་སྡིག་པའི་ཆོས་མང་པོ་དང་། ཡིད་མི་བདེ་བ་མང་པོ་འབྱུང་བར་འགྱུར་ཏེ།
en: Tremendous harm will unfold and a lot of unhappiness will be experienced in such a place.

source: དེས་ན་རྒྱལ་རིགས་རྒྱལ་པོ་དེས་བདག་གི་ཡུལ་དུ་ཆོས་ནུབ་པར་གྱུར་ཏོ་སྙམ་དུ་འཚལ་བར་བགྱི་སྟེ།
en: Therefore the ruling class and the king should realize, ‘The Dharma has vanished from our realm,’

source: དེས་ཆོས་སྤྱད་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: and then take up the practice of the Dharma.” “Excellent, excellent,” replied the Blessed One.

source: དེ་ནི་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུ་དཔེར་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་ལ་ལ་ཞིག་གིས་
en: “Thus it is, noble son! Noble son, as an analogy, consider a faithful noble son or daughter who,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་ལོ་བརྒྱ་འམ། ལོ་སྟོང་གི་བར་དུ་བླ་ན་མེད་པའི་མཆོད་པས་མཆོད་པ་བྱེད་ལ།
en: for a hundred or even a thousand years, worships with unsurpassed offerings as many thus-gone, worthy, perfect buddhas as there are grains of sand in the Ganges River.

source: འཛམ་བུའི་གླིང་འདི་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བར་བྱས་ཏེ། ཉན་ཐོས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་དང་།
en: Suppose that person also makes offerings to the śrāvakas and pratyekabuddhas by filling up this world with precious jewels and offering it to them,

source: བདག་ཉིད་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དང་། ཆུང་མ་དང་། བུ་དང་བུ་མོ་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དང་།
en: and also gives away their own body, spouse, sons, and daughters as offerings.

source: ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་པར་འགྱུར་ཏེ།
en: By comparison, however, a person creates much more merit

source: གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཆོད་པའམ་ཡི་གེར་འདྲིའམ་ཡི་གེར་འདྲིར་འཇུག་པའམ། ཀློག་པའམ།
en: by worshiping this Dharma teaching, writing it down, reading it aloud, commissioning it to be written, worshiping

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་བ་རྣམས་ཀྱིས་མཆོད་དེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཕྱིར་ཞོའི་བརྒྱད་ཆ་ཅིག་ཙམ་སྦྱིན་པ་བྱིན་ན་དེ་ནི་དེ་བས་
en: it with flowers, incense, perfumes, and flower garlands, or by offering even just a single karṣāpaṇa to it.

source: དགེ་བའི་རྩ་བ་སྔ་མ་ཤོས་དེ་ནི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་ན།
en: The roots of virtue generated in the former cases do not match even one percent of the merit generated by venerating this sutra.

source: གང་བླ་མའི་འདུ་ཤེས་བསྐྱེད་དེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་ཅིང་།
en: “If someone, perceiving this teaching as their master, worships it with parasols, victory banners, and flags, or

source: ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་གོས་སམ། རྒྱན་ནམ། གདུགས་སམ། བཞོན་པའམ། གྲོང་ངམ། གྲོང་ཁྱེར་རམ། ས་གཞི་བ་ལང་གི་རྨིག་རྗེས་ཙམ་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཕྱིར་སྦྱིན་པ་བྱེད་ལ།
en: requests this Dharma teaching by offering clothes, ornaments, parasols, carriages, villages, cities, or even a piece of land the size of an ox’s hoof print to those who teach it, and, having been instructed in this Dharma teaching,

source: ལུས་འདི་ནི་སྙིང་པོ་མེད་པའོ་སྙམ་དུ་ཤེས་ཤིང་རྨི་ལམ་ལྟ་བུའོ། །སྒྱུ་མ་ལྟ་བུའོ། །
en: understands that their body is insubstantial like a dream, an illusion,

source: ཆུའི་ཆུ་བུར་ལྟ་བུའོ་སྙམ་དུ་ཤེས་ཏེ། ལུས་འདི་ལ་ནི་སྙིང་པོ་མེད་དོ། །ཆོས་ཐམས་ཅད་ནི་མི་རྟག་པའོ་སྙམ་དུ་ཤེས་ན།
en: or a water bubble—that this body is insubstantial and all phenomena are impermanent

source: དེ་ནི་དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་པ་ཁོ་ན་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པས་དབུགས་ཕྱུང་བ་ཁོ་ན་ཡིན་ནོ།
en: —then they have been prophesied and inspired by the thus-gone ones,

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པ་ཡིན་ནོ། །ཕྱིས་ཀྱང་མཐར་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: and will worship all the thus-gone ones until eventually they awaken to unsurpassed, perfect buddhahood.”

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ལྷའི་དབང་པོ་རྣམས་དང་། ཀླུའི་དབང་པོ་རྣམས་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་རྣམས་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་རྣམས་དང་།
en: At that moment all the bodhisattvas, the lords of the gods, the lords of the nāgas, the lords of the yakṣas, the lords of the rākṣasas,

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་རྣམས་དང་མིའམ་ཅིའི་དབང་པོ་རྣམས་ཀྱིས་ཚིག་འཐུན་པར་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: the lords of the garuḍas, and the lords of the kinnaras expressed in unison their approval to the Blessed One:

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ། །འདི་ནི་ཆོས་ཀྱི་འཁོར་ལོ་ལན་གཉིས་བསྐོར་བར་གྱུར་ཏོ། །
en: “Excellent, excellent, Blessed One! This was a second turning of the wheel of Dharma.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་གཅིག་ཏུ་འཐུན་པར་བགྱིས་ཏེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པར་བགྱིའོ། །
en: Blessed One, we will all act in accordance with this Dharma teaching and worship it.

source: ཡུལ་དེ་ཡང་བསྐྱང་བར་བགྱིའོ། །ཆོས་སྨྲ་བ་དེ་ལ་ཡང་མཆོད་པར་བགྱི། བསྲུང་བར་བགྱི། ལུང་བསྟན་པར་བགྱི། དབུགས་དབྱུང་བར་བགྱིའོ། །
en: We will also protect that land. We will worship those who teach it, and will protect them, appear to them, and inspire them.

source: གང་ལ་ལ་ཆོས་སྨྲ་བ་དང་། ཡི་གེར་འདྲི་བ་དང་། འཛིན་པ་དང་།
en: Whoever perceives the teachers of this Dharma, or those who write it down, memorize it,

source: ཀློག་པ་དེ་ལ་བླ་མའི་འདུ་ཤེས་སྐྱེད་པ་དང་། ཕའི་འདུ་ཤེས་དང་། བུའི་འདུ་ཤེས་སྐྱེད་པ་དེ་ལ་ནི་བདག་ཅག་གིས་ཀྱང་ཕའི་འདུ་ཤེས་བསྐྱེད་པར་བགྱིའོ། །
en: and read it aloud, as their own master, parent, or child, we too will regard them as our own parents.

source: གལ་ཏེ་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་མ་རུངས་པར་བགྱིད་ན་ནི་དེའི་ཡུལ་ཐམས་ཅད་དུ་བུ་དང་མཆིས་བྲང་དང་ཕ་མ་ཡིད་མི་བདེ་བར་འགྱུར་ལ།
en: Anywhere this Dharma teaching becomes corrupted there will be strife among children, spouses, and parents,

source: དེའི་འོག་ཏུ་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བར་འགྱུར་རོ།
en: and all will be reborn in the hells.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷའི་དབང་པོ་ནས་མིའི་དབང་པོའི་བར་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One expressed his approval to the bodhisattvas and to everyone else, from the lords of the gods to the lords of the humans, saying,

source: རིགས་ཀྱི་བུ་དག་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent, noble sons!

source: གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་གྱིས་ཤིག །
en: My friends, please do exactly that!

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་དུ་གཞུག་པ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་གཏད་དོ།
en: I entrust this Dharma teaching to you so that you may propagate and worship it.

source: དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མྱུར་དུ་ནུབ་པར་གྱུར་ཏ་རེ། །
en: May this Dharma teaching that is equal to the Thus-Gone One not rapidly vanish,

source: ལ་ལ་ཞིག་གིས་སྤངས་ཏེ། སེམས་ཅན་དམྱལ་བར་ལྷུང་ང་རེ།
en: and may no one discard it and fall into the hell realms.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བར་འགྱུར་བའོ། །
en: This Dharma teaching will bring benefit and happiness to many beings.

source: ཁྱེད་ཕྱིས་འགྱོད་པར་གྱུར་ཏ་རེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པ་ན། ས་ཆེན་པོ་འདི་གཡོས་ཏེ། གཡོས་རབ་ཏུ་གཡོས་སོ། །
en: Have no regrets!” When this Dharma teaching was taught, this world wobbled and rocked.

source: སྲོག་ཆགས་དྲུག་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: The minds of six thousand beings were liberated from their defilements with no further grasping.

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། འཛིན་པ་དང་།
en: “Blessed One, if someone writes this Dharma teaching down, commissions it to be written, memorizes it,

source: ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་པ་དང་།
en: reads it aloud, masters it, teaches it extensively

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པར་བགྱིད་ན། །
en: and genuinely, and worships it with flowers, incense, perfumes, flower garlands, ointments, powders, clothes, parasols, victory banners, and flags,

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་བསོད་ནམས་ཇི་སྙེད་ཅིག་སྐྱེད་པར་འགྱུར་ལགས། གང་དུ་ནི་སྐྱེ་བར་འགྱུར་ལགས།
en: how much merit will that noble son or daughter generate? Where will they be reborn?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། །
en: The Blessed One expressed his approval to the bodhisattva noble Avaloki­teśvara, saying,

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: “Excellent, excellent, noble son!

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་འདི་ཞུས་པ་ནི་ལེགས་སོ། །
en: It is excellent that you ask the Thus-Gone One about this matter!

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Noble son, listen carefully and keep in mind what I will explain to you now.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་། འཛིན་པ་དང་།
en: If a noble son or daughter writes this Dharma teaching down, commissions it to be written, memorizes it,

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་པ་དེ་ནི་
en: and genuinely, and worships it with flowers, incense, perfumes, flower garlands, ointments, powders, clothes, parasols, victory banners, and flags,

source: འདི་ནས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: when they die they will be reborn in Sukhāvatī.

source: རིགས་ཀྱི་བུ་གང་ལ་ལས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་ས་ཡོངས་སུ་གང་བར་བྱས་ཏེ། ཉན་ཐོས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་བས་ནི
en: “Noble son, compared to making offerings to all the śrāvakas and pratyekabuddhas by filling up this great trichiliocosm with precious jewels,

source: རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་གྱི། །
en: the merit generated by a noble son or daughter

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། མཆོད་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་།
en: who upholds this Dharma teaching, worships it, writes it down, commissions it to be written,

source: ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་ལ་སོགས་པས་མཆོད་པ་འདི་
en: and worships those who teach it with offerings such as flowers, incense, perfumes, flower garlands, and ointments will be much greater.

source: རིགས་ཀྱི་བུ་སྔ་མ་གང་ཡིན་པ་དེས་ནི་དེ་སྙེད་བསགས་པ་མ་ཡིན་ནོ། །
en: Noble son, the merit generated is not at all comparable.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་དེ།
en: “Noble son, a noble son or daughter who engages in bodhisattva conduct

source: བུ་དང་། བུ་མོ་དང་། ཆུང་མ་ཡོངས་སུ་གཏོང་བ་དང་། ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་། མགོ་བོ་ཡོངས་སུ་གཏོང་བ་བས་ནི་
en: will give away their own sons, daughters, spouse, arms, legs, eyes, and head as offerings.

source: གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བའམ། ཡི་གེར་འདྲིར་འཇུག་གམ།
en: Compared to them, someone who writes this Dharma teaching down, commissions it to be written,

source: ཀློག་གམ། དད་པར་བྱེད་པ་འདི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་གྱི།
en: reads it aloud, and inspires faith in it will generate much more merit.

source: རིགས་ཀྱི་བུ་སྔ་མ་གང་ཡིན་པ་དེས་ནི་དེ་སྙེད་བསགས་པ་མ་ཡིན་ནོ།
en: Noble son, the merit is not at all comparable.

source: ཆོས་སྨྲ་བའི་རིགས་ཀྱི་བུ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བ་ཁོ་ནར་བལྟ་བར་བྱའོ། །དེ་བཞིན་གཤེགས་པ་དང་འདྲ་བ་ཁོ་ནར་མཆོད་པ་མངོན་པར་འདུ་བྱ་བར་བྱའོ། །
en: One should regard a noble one who spreads this teaching as a thus-gone one and perform worship exactly as one would for a thus-gone one.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བགྱི་བའི་འོས་ལགས་སོ། །
en: “this Dharma teaching is to be revered by the world with its gods, humans, and asuras.

source: ཆོས་སྨྲ་བ་དེ་ལ་ཡང་ཕྱག་བགྱི་བ་དང་མཆོད་པར་བགྱི་བའི་འོས་ལགས་སོ། །
en: Those who teach it are also worthy of reverence and worship.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་རྫུ་འཕྲུལ་ཆེ་བ་ལགས་ཏེ། །
en: Blessed One, this Dharma teaching is a great miracle!

source: དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གུས་པར་བགྱིས་ཏེ་མཉན་པར་བགྱིའོ། །གུས་པར་བགྱིས་ཏེ་ཡིད་ལ་བགྱིའོ། །
en: Therefore, all noble sons and daughters should respectfully listen to it and keep it in mind.
